mdmfile/src/Catalogs/мдмБизнесПроцессы/мдмБизнесПроцессы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>мдмБизнесПроцессы</name>
  <basedOn>Catalog.мдмСхемыДанных</basedOn>
  <attributes>
    <name>Имя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Использовать</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Карта</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>CatalogRef.мдмБизнесПроцессы</types>
    </type>
  </attributes>
  <attributes>
    <name>СхемаДанных</name>
    <type>
      <types>CatalogRef.мдмСхемыДанных</types>
    </type>
  </attributes>
  <attributes>
    <name>ФормаДанных</name>
    <type>
      <types>CatalogRef.мдмФормыДанных</types>
    </type>
  </attributes>
  <attributes>
    <name>НастройкаСписка</name>
    <type>
      <types>CatalogRef.мдмНастройкиСписков</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипПредмета</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ПолноеИмяМетаданныхПредмета</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗаполнениеДанныхБизнесПроцесса</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:Catalog>

mdmfile/src/Catalogs/мдмФормыДанных/мдмФормыДанных.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>мдмФормыДанных</name>
  <owners>Catalog.мдмБизнесПроцессы</owners>
  <attributes>
    <name>СхемаДанных</name>
    <type>
      <types>CatalogRef.мдмСхемыДанных</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредставлениеСсылки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Имя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>CatalogRef.мдмФормыДанных</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СтруктураФормы</name>
    <attributes>
      <name>Идентификатор</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Родитель</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипЭлемента</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>80</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Имя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>80</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Заголовок</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>80</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПутьКДанным</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>160</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИмяКоманды</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Свойства</name>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерКартинки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>УсловноеОформление</name>
    <attributes>
      <name>ИмяЭлемента</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>80</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Условие</name>
      <type>
        <types>CatalogRef.мдмОтборы</types>
      </type>
    </attributes>
    <attributes>
      <name>Оформление</name>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>УсловнаяОбязательность</name>
    <attributes>
      <name>ПутьКДанным</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>160</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Условие</name>
      <type>
        <types>CatalogRef.мдмОтборы</types>
      </type>
    </attributes>
    <attributes>
      <name>Проверять</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

mdmfile/src/Catalogs/мдмБизнесПроцессы/ObjectModule.bsl
Перем ИзменилосьНаименование;

#Область ПрограммныйИнтерфейс

Функция КлючОбъекта() Экспорт
	Возврат "Имя";
КонецФункции	

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	ИзменилосьНаименование = Наименование <> Ссылка.Наименование;
	
	Тип = ТипПредмета.Получить();
	Если ТипЗнч(Тип) = Тип("ОписаниеТипов") И Тип.Типы().Количество() тогда 
		МетаданныеПредмета = Метаданные.НайтиПоТипу(Тип.Типы()[0]);
		Если МетаданныеПредмета <> Неопределено тогда
			ПолноеИмяМетаданныхПредмета = МетаданныеПредмета.ПолноеИмя();
		КонецЕсли;	
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если Использовать тогда
		
		Отказ = Не Справочники.мдмБизнесПроцессы.ПроверитьСхему(Ссылка);
		
	КонецЕсли;	
	
	Если Не Отказ И ИзменилосьНаименование тогда
		
		Выборка = Справочники.мдмФормыДанных.Выбрать(, Ссылка);
		Пока Выборка.Следующий() цикл
			Объект = Выборка.ПолучитьОбъект();
			Объект.ПредставлениеСсылки = Наименование + "." + Выборка.Наименование;
			Объект.Записать();
		КонецЦикла;	
		
	КонецЕсли;	
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.мдмСхемыДанных") Тогда
		Наименование = ДанныеЗаполнения.Наименование;
		Имя = ДанныеЗаполнения.Наименование;
		СхемаДанных = ДанныеЗаполнения.Ссылка;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
